In [1]:
import pandas as pd
import numpy as np

In [2]:
raw_csv_data = pd.read_csv("Index2018.csv") 
df_comp = raw_csv_data.copy()

### Análisis Descriptivo
No incluye fecha porque no es numerica - tal como esta es texto

In [3]:
df_comp

            date          spx       dax         ftse    nikkei
0     07/01/1994   469.900000   2224.95  3445.980000  18124.01
1     10/01/1994   475.270000   2225.00  3440.580000  18443.44
2     11/01/1994   474.130000   2228.10  3413.770000  18485.25
3     12/01/1994   474.170000   2182.06  3372.020000  18793.88
4     13/01/1994   472.470000   2142.37  3360.010000  18577.26
...          ...          ...       ...          ...       ...
6264  23/01/2018  2839.130362  13559.60  7731.827774  24124.15
6265  24/01/2018  2837.544008  13414.74  7643.428966  23940.78
6266  25/01/2018  2839.253031  13298.36  7615.839954  23669.49
6267  26/01/2018  2872.867839  13340.17  7665.541292  23631.88
6268  29/01/2018  2853.528411  13324.48  7671.533300  23629.34

[6269 rows x 5 columns]

In [4]:
df_comp.describe()

               spx           dax         ftse        nikkei
count  6269.000000   6269.000000  6269.000000   6269.000000
mean   1288.127542   6080.063363  5422.713545  14597.055700
std     487.586473   2754.361032  1145.572428   4043.122953
min     438.920000   1911.700000  2876.600000   7054.980000
25%     990.671905   4069.350000  4486.100000  10709.290000
50%    1233.420000   5773.340000  5662.430000  15028.170000
75%    1459.987747   7443.070000  6304.250000  17860.470000
max    2872.867839  13559.600000  7778.637689  24124.150000

In [5]:
# Vemos si hay valores no válidos
df_comp.isna().sum()

date      0
spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

In [6]:
df_comp.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

Si el formato es `.describe()` de date, entonces los datos no son realistas al ser texto; el top es un valor arbitrario, considera Python que todos son 1 al no ser 0, cualquier fecha es valor top, en este caso pone la primera fecha

In [7]:
df_comp.date.describe()

count           6269
unique          6269
top       07/01/1994
freq               1
Name: date, dtype: object

In [8]:
df_comp.date

0       07/01/1994
1       10/01/1994
2       11/01/1994
3       12/01/1994
4       13/01/1994
           ...
6264    23/01/2018
6265    24/01/2018
6266    25/01/2018
6267    26/01/2018
6268    29/01/2018
Name: date, Length: 6269, dtype: object

In [9]:
# Vemos el tipo de dato que es la serie 'date'
type(df_comp.date[0])

str

### Convertir de formato texto a formato fecha

In [10]:
# Función de pandas to_datetime - la guardamos en la misma variable, la transformamos
# dayfirst= True, característica del método, se supone por defecto mes/dia/año ... nosotros tenemos dia/mes/año
df_comp.date = pd.to_datetime(df_comp.date, dayfirst=True)

In [11]:
# Ha cambiado el formato fecha - es la representacion mas conveniente al verse rapido como cambian las fechas
df_comp.head(10)

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26
5 1994-01-14  474.91  2151.05  3400.56  18973.70
6 1994-01-17  473.30  2115.56  3407.83  18725.37
7 1994-01-18  474.25  2130.35  3437.01  18514.55
8 1994-01-19  474.30  2132.52  3475.15  19039.40
9 1994-01-20  474.98  2098.36  3469.99  19183.92

In [12]:
df_comp.tail(5)

           date          spx       dax         ftse    nikkei
6264 2018-01-23  2839.130362  13559.60  7731.827774  24124.15
6265 2018-01-24  2837.544008  13414.74  7643.428966  23940.78
6266 2018-01-25  2839.253031  13298.36  7615.839954  23669.49
6267 2018-01-26  2872.867839  13340.17  7665.541292  23631.88
6268 2018-01-29  2853.528411  13324.48  7671.533300  23629.34

In [13]:
# Vemos que ahora el tipo de dato de la serie 'date' ha cambiado, ya es de tiempo
type(df_comp.date[0])

pandas._libs.tslibs.timestamps.Timestamp

In [14]:
df_comp.date.describe()

count                             6269
mean     2006-01-14 19:36:59.492742144
min                1994-01-07 00:00:00
25%                2000-01-11 00:00:00
50%                2006-01-12 00:00:00
75%                2012-01-19 00:00:00
max                2018-01-29 00:00:00
Name: date, dtype: object

### Fecha como índice de la serie temporal

In [15]:
df_comp.set_index("date", inplace=True)

# asi podemos acceder la fecha como indice, en un dia en concreto o entre dos fechas en concreto.
# metodo set_index se aplica al datset completo, y se le pasa la variable que queremos como indice.
# inplace es para que coja date como variable de indice. Si no se pone no lo sustituye por el indice actual (que es 0, 1 ,2 ...)
# ver que pasa si no se pone inplace

In [16]:
df_comp.head(10)

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26
1994-01-14  474.91  2151.05  3400.56  18973.70
1994-01-17  473.30  2115.56  3407.83  18725.37
1994-01-18  474.25  2130.35  3437.01  18514.55
1994-01-19  474.30  2132.52  3475.15  19039.40
1994-01-20  474.98  2098.36  3469.99  19183.92

In [17]:
# Vemos si hay valores no válidos
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

### Definiendo la Frecuencia
La frecuencia debe ser constante para poder hacer análisis de series temporales.

In [18]:
# Aquí no había frecuencia originalmente, la estamos estableciendo primero a diaria 'D'
df_comp = df_comp.asfreq('D')

# h indicara que se registra cada hora
# w datos semanales
# d datos diarios
# m datos mensuales
# a datos anuales (annual)

# PROBAR B: business days

In [19]:
""" Crea los dias que faltan para tener siempre el mismo periodo de tiempo
+ NaN = not a number
+ No se tienen datos de los fines de semana que no funcionan las bolsas - o por vacaciones - o por errores ...
no tiene sentido considerarlo ya que no hay datos de fin de semana o para días no hábiles
no se tienen datos"""
df_comp.head(20)

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-08     NaN      NaN      NaN       NaN
1994-01-09     NaN      NaN      NaN       NaN
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26
1994-01-14  474.91  2151.05  3400.56  18973.70
1994-01-15     NaN      NaN      NaN       NaN
1994-01-16     NaN      NaN      NaN       NaN
1994-01-17  473.30  2115.56  3407.83  18725.37
1994-01-18  474.25  2130.35  3437.01  18514.55
1994-01-19  474.30  2132.52  3475.15  19039.40
1994-01-20  474.98  2098.36  3469.99  19183.92
1994-01-21  474.72  2073.94  3484.21  19307.43
1994-01-22     NaN      NaN      NaN       NaN
1994-01-23     NaN      NaN      NaN       NaN
1994-01-24  471.97  2107.29  3481.42  18353.24
1994-01-25  470.92  2090.78  3443.97  18648.36
1994-01-26  473.20  2128.66  3436.08  19138.21

In [20]:
df_comp = df_comp.asfreq('B')

# La letra 'B' se refiere a business days. Deja fuera días de trabajo y genera la serie temporal solo con los dias que deben de tener valor
# todavía pueden faltar si hubo errores, pues se establecio la frecunecia a diaria, introduciendo datos 'NaN' y luego se volvió
# a la frecuencia de 'bussiness day', pero los datos nulos siguen ahí !!
# la frecuencia sigue siendo la misma por día - business day - de viernes a lunes no hay ningún problema

In [21]:
df_comp.head(10)

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26
1994-01-14  474.91  2151.05  3400.56  18973.70
1994-01-17  473.30  2115.56  3407.83  18725.37
1994-01-18  474.25  2130.35  3437.01  18514.55
1994-01-19  474.30  2132.52  3475.15  19039.40
1994-01-20  474.98  2098.36  3469.99  19183.92

In [22]:
df_comp.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6277 entries, 1994-01-07 to 2018-01-29
Freq: B
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   spx     6269 non-null   float64
 1   dax     6269 non-null   float64
 2   ftse    6269 non-null   float64
 3   nikkei  6269 non-null   float64
dtypes: float64(4)
memory usage: 245.2 KB

In [23]:
# Cambiamos la frecuencia a horaria
df_comp = df_comp.asfreq('h')

In [24]:
df_comp.isna().sum()

spx       204644
dax       204644
ftse      204644
nikkei    204644
dtype: int64

In [25]:
df_comp.head(10)

                       spx      dax     ftse    nikkei
date
1994-01-07 00:00:00  469.9  2224.95  3445.98  18124.01
1994-01-07 01:00:00    NaN      NaN      NaN       NaN
1994-01-07 02:00:00    NaN      NaN      NaN       NaN
1994-01-07 03:00:00    NaN      NaN      NaN       NaN
1994-01-07 04:00:00    NaN      NaN      NaN       NaN
1994-01-07 05:00:00    NaN      NaN      NaN       NaN
1994-01-07 06:00:00    NaN      NaN      NaN       NaN
1994-01-07 07:00:00    NaN      NaN      NaN       NaN
1994-01-07 08:00:00    NaN      NaN      NaN       NaN
1994-01-07 09:00:00    NaN      NaN      NaN       NaN

### Tratar los Valores Faltantes (Ver detalles en las diapositivas)

In [26]:
df_comp = df_comp.asfreq('B')

df_comp.isna().sum()

# despues de poner la frecuencia adecuada, vemos que hay 8 que faltan
# faltan 8 fechas para las 4 variables

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [27]:
df_comp.isna()

              spx    dax   ftse  nikkei
date
1994-01-07  False  False  False   False
1994-01-10  False  False  False   False
1994-01-11  False  False  False   False
1994-01-12  False  False  False   False
1994-01-13  False  False  False   False
...           ...    ...    ...     ...
2018-01-23  False  False  False   False
2018-01-24  False  False  False   False
2018-01-25  False  False  False   False
2018-01-26  False  False  False   False
2018-01-29  False  False  False   False

[6277 rows x 4 columns]

In [28]:
df_comp.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [29]:
print("\nRows containing missing values:")
print(df_comp[df_comp.isna().any(axis=1)])

Rows containing missing values:
            spx  dax  ftse  nikkei
date
2008-01-01  NaN  NaN   NaN     NaN
2009-01-01  NaN  NaN   NaN     NaN
2010-01-01  NaN  NaN   NaN     NaN
2013-01-01  NaN  NaN   NaN     NaN
2014-01-01  NaN  NaN   NaN     NaN
2015-01-01  NaN  NaN   NaN     NaN
2016-01-01  NaN  NaN   NaN     NaN
2018-01-01  NaN  NaN   NaN     NaN

**Resumen**:
```python 
df_comp = raw_csv_data.copy() 
df_comp.date = pd.to_datetime(df_comp.date, dayfirst=True)
df_comp.set_index("date", inplace = True)
df_comp = df_comp.asfreq('B')
df_comp.isna().sum()
```

In [30]:
df_comp

                    spx       dax         ftse    nikkei
date
1994-01-07   469.900000   2224.95  3445.980000  18124.01
1994-01-10   475.270000   2225.00  3440.580000  18443.44
1994-01-11   474.130000   2228.10  3413.770000  18485.25
1994-01-12   474.170000   2182.06  3372.020000  18793.88
1994-01-13   472.470000   2142.37  3360.010000  18577.26
...                 ...       ...          ...       ...
2018-01-23  2839.130362  13559.60  7731.827774  24124.15
2018-01-24  2837.544008  13414.74  7643.428966  23940.78
2018-01-25  2839.253031  13298.36  7615.839954  23669.49
2018-01-26  2872.867839  13340.17  7665.541292  23631.88
2018-01-29  2853.528411  13324.48  7671.533300  23629.34

[6277 rows x 4 columns]

Aquí utilizamos un método de relleno de valores faltantes

In [31]:
df_comp.spx = df_comp.spx.ffill()

# df_comp.spx = df_comp.spx.fillna(method='ffill')
# el metodo fillna rellena los NaN - los valores faltantes.
#el metodo ffill : front filling - asigna al valor faltante el valor del periodo posterior (el de enfrente)

In [32]:
df_comp.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [33]:
df_comp.ftse = df_comp.ftse.bfill()
df_comp.isna().sum()
#df_comp.ftse=df_comp.ftse.fillna(method='bfill')

# back filling - lo rellena con el periodo anterior (el dia anterior en este caso)

spx       0
dax       8
ftse      0
nikkei    8
dtype: int64

In [34]:
df_comp.dax = df_comp.dax.fillna(value = df_comp.dax.mean())

#otra forma es asignar el valor medio a los valores faltantes
#en general para series temporales esto no tiene sentido - solo seria apropiado si fluctua alrededor de la media 
# si hay tendencia , al no ser estable, no tiene sentido ...
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

In [35]:
df_comp.nikkei = df_comp.nikkei.bfill()
# df_comp.nikkei = df_comp.nikkei.fillna(method='bfill')

df_comp.isna().sum()

#ya no falta ninguno

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

### Simplificación de la Serie Temporal
Eliminaremos columnas de la serie temporal, ya que en general se examina una sola serie temporal.
Cuantos menos datos, más rápido es la manipulación - pero para datos de alta fecuencia son muy relevantes este tipo de simplificaciones.

In [36]:
df_comp['market_value']=df_comp.spx

In [37]:
df_comp.describe()

               spx           dax         ftse        nikkei  market_value
count  6277.000000   6277.000000  6277.000000   6277.000000   6277.000000
mean   1288.642547   6080.063363  5423.690398  14597.597179   1288.642547
std     487.868210   2752.604984  1145.568370   4043.683038    487.868210
min     438.920000   1911.700000  2876.600000   7054.980000    438.920000
25%     992.715221   4070.460000  4487.880000  10701.130000    992.715221
50%    1233.761241   5774.380000  5663.300000  15030.510000   1233.761241
75%    1460.250000   7442.660000  6304.630175  17860.470000   1460.250000
max    2872.867839  13559.600000  7778.637689  24124.150000   2872.867839

In [38]:
del df_comp['spx']

In [39]:
df_comp.describe()

                dax         ftse        nikkei  market_value
count   6277.000000  6277.000000   6277.000000   6277.000000
mean    6080.063363  5423.690398  14597.597179   1288.642547
std     2752.604984  1145.568370   4043.683038    487.868210
min     1911.700000  2876.600000   7054.980000    438.920000
25%     4070.460000  4487.880000  10701.130000    992.715221
50%     5774.380000  5663.300000  15030.510000   1233.761241
75%     7442.660000  6304.630175  17860.470000   1460.250000
max    13559.600000  7778.637689  24124.150000   2872.867839

In [40]:
del df_comp['dax']
del df_comp['ftse']
del df_comp['nikkei']

In [41]:
df_comp

            market_value
date
1994-01-07    469.900000
1994-01-10    475.270000
1994-01-11    474.130000
1994-01-12    474.170000
1994-01-13    472.470000
...                  ...
2018-01-23   2839.130362
2018-01-24   2837.544008
2018-01-25   2839.253031
2018-01-26   2872.867839
2018-01-29   2853.528411

[6277 rows x 1 columns]

### División entre Training y Testing

- Necesario si se va a aplicar técnicas de Machine Learning a las series temporales. Vale también para comparar las series temporales
- Cuanto más se acerque la predicción a los valores mejor será el modelo
- En la solución típica se barajan los datos antes de dividirlos, pero los datos en serie temporales dependen de mantener un orden cronológico, no se pueden barajar los datos, pues Entrenamiento y Test deben ser secuencias continuas.
- El tamaño es como siempre discutible. Muy grande sobre ajuste y muy pequeño falta de precisión.
- En general 0.80 0 0.70 está bien.

In [42]:
size = int(len(df_comp)*0.8)

In [43]:
df = df_comp.iloc[:size]

In [44]:
df_test = df_comp.iloc[size:]

In [45]:
df.tail()

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [46]:
df_test.head()

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623